Repository: RudraNarayanChatterjee/passpilot
Catalog: locale/*/LC_MESSAGES/passpilot.po
Languages: hi

source: PassPilot Supreme
hi: पासपायलट सुप्रीम

source: Military-Grade Password Security Toolkit
hi: सैन्य-ग्रेड पासवर्ड सुरक्षा टूलकिट

source: Ready
hi: तैयार

source: File
hi: फ़ाइल

source: Export History
hi: इतिहास निर्यात करें

source: Exit
hi: बाहर निकलें

source: View
hi: देखें

source: Dark Mode
hi: डार्क मोड

source: Show Passwords
hi: पासवर्ड दिखाएं

source: Help
hi: सहायता

source: Keyboard Shortcuts
hi: कीबोर्ड शॉर्टकट

source: About
hi: के बारे में

source: Language
hi: भाषा

source: Language Change
hi: भाषा परिवर्तन

source: Language changed to {0}. Please restart the application for changes to take effect.
hi: भाषा {0} में बदल गई। परिवर्तनों को प्रभावी करने के लिए कृपया एप्लिकेशन को पुनरारंभ करें।

source: Generator
hi: जनरेटर

source: Analyzer
hi: विश्लेषक

source: History
hi: इतिहास

source: Quick Presets
hi: त्वरित प्रीसेट

source: Custom Settings
hi: कस्टम सेटिंग्स

source: Length:
hi: लंबाई:

source: Lowercase (a-z)
hi: लोअरकेस (a-z)

source: Uppercase (A-Z)
hi: अपरकेस (A-Z)

source: Numbers (0-9)
hi: संख्याएं (0-9)

source: Symbols (!@#$%)
hi: प्रतीक (!@#$%)

source: Exclude ambiguous (0OIl1|)
hi: अस्पष्ट को बाहर करें (0OIl1|)

source: Generated Password
hi: जनरेट किया गया पासवर्ड

source: Generate Password (Ctrl+G)
hi: पासवर्ड जनरेट करें (Ctrl+G)

source: Generate Passphrase (Ctrl+P)
hi: पासफ्रेज जनरेट करें (Ctrl+P)

source: Copy to Clipboard (Ctrl+C)
hi: क्लिपबोर्ड में कॉपी करें (Ctrl+C)

source: Password Analysis
hi: पासवर्ड विश्लेषण

source: Enter password to analyze:
hi: विश्लेषण के लिए पासवर्ड दर्ज करें:

source: Strength Visualization
hi: शक्ति विज़ुअलाइज़ेशन

source: Enter a password to analyze
hi: विश्लेषण के लिए एक पासवर्ड दर्ज करें

source: Detailed Metrics
hi: विस्तृत मीट्रिक्स

source: Entropy: - bits
hi: एन्ट्रॉपी: - बिट्स

source: Est. crack time: -
hi: अनुमानित क्रैक समय: -

source: Character diversity: -
hi: वर्ण विविधता: -

source: Improvement Suggestions
hi: सुधार सुझाव

source: Check if Exposed in Data Breach
hi: डेटा उल्लंघन में उजागर हुई है या नहीं जांचें

source: Increase length to at least 12 characters
hi: लंबाई को कम से कम 12 वर्णों तक बढ़ाएं

source: Add lowercase letters
hi: लोअरकेस अक्षर जोड़ें

source: Add uppercase letters
hi: अपरकेस अक्षर जोड़ें

source: Add numbers
hi: संख्याएं जोड़ें

source: Add special characters
hi: विशेष वर्ण जोड़ें

source: Avoid common patterns and sequences
hi: सामान्य पैटर्न और अनुक्रमों से बचें

source: Use more unique characters
hi: अधिक अद्वितीय वर्णों का उपयोग करें

source: Your password is excellent!
hi: आपका पासवर्ड उत्कृष्ट है!

source: Critical
hi: गंभीर

source: Very Weak
hi: बहुत कमजोर

source: Weak
hi: कमजोर

source: Fair
hi: सामान्य

source: Good
hi: अच्छा

source: Strong
hi: मजबूत

source: Very Strong
hi: बहुत मजबूत

source: Exceptional
hi: असाधारण

source: Warning
hi: चेतावनी

source: Please select at least one character type!
hi: कृपया कम से कम एक वर्ण प्रकार चुनें!

source: Password generated ({0} characters)
hi: पासवर्ड जनरेट किया गया ({0} वर्ण)

source: Passphrase generated
hi: पासफ्रेज जनरेट किया गया

source: No password to copy!
hi: कॉपी करने के लिए कोई पासवर्ड नहीं!

source: Copied! Clipboard will clear in 30 seconds...
hi: कॉपी किया गया! क्लिपबोर्ड 30 सेकंड में साफ़ हो जाएगा...

source: Clipboard cleared for security
hi: सुरक्षा के लिए क्लिपबोर्ड साफ़ किया गया

source: Info
hi: जानकारी

source: Please enter a password to check.
hi: कृपया जांचने के लिए एक पासवर्ड दर्ज करें।

source: Checking...
hi: जांच हो रही है...

source: Checking breach database...
hi: उल्लंघन डेटाबेस की जांच हो रही है...

source: Breach check failed
hi: उल्लंघन जांच विफल

source: Password is compromised!
hi: पासवर्ड समझौता किया गया है!

source: Password passed breach check
hi: पासवर्ड उल्लंघन जांच पास किया

source: Please select a password from history.
hi: कृपया इतिहास से एक पासवर्ड चुनें।

source: Success
hi: सफलता

source: Password copied from history!
hi: इतिहास से पासवर्ड कॉपी किया गया!

source: Confirm
hi: पुष्टि करें

source: Clear all password history?
hi: सभी पासवर्ड इतिहास साफ़ करें?

source: History cleared
hi: इतिहास साफ़ किया गया

source: No history to export.
hi: निर्यात करने के लिए कोई इतिहास नहीं।

source: JSON files
hi: JSON फ़ाइलें

source: All files
hi: सभी फ़ाइलें

source: History exported to {0}
hi: इतिहास {0} में निर्यात किया गया

source: Export failed: {0}
hi: निर्यात विफल: {0}

source: Session Password History (In-Memory Only)
hi: सत्र पासवर्ड इतिहास (केवल मेमोरी में)

source: Passwords are stored only for this session and are never written to disk.
hi: पासवर्ड केवल इस सत्र के लिए संग्रहीत किए जाते हैं और कभी भी डिस्क पर नहीं लिखे जाते।

source: Copy Selected
hi: चयनित कॉपी करें

source: Refresh
hi: रीफ्रेश करें

source: Clear History
hi: इतिहास साफ़ करें

source: PassPilot Supreme - Keyboard Shortcuts ===================================== Ctrl+G Generate Password Ctrl+P Generate Passphrase Ctrl+C Copy to Clipboard F1 Show This Help Features: • Military-grade password generation • Real-time strength analysis • Breach database checking (Have I Been Pwned) • Pattern detection & suggestions • Secure clipboard with auto-clear • Session-only password history
hi: पासपायलट सुप्रीम - कीबोर्ड शॉर्टकट ===================================== Ctrl+G पासवर्ड जनरेट करें Ctrl+P पासफ्रेज जनरेट करें Ctrl+C क्लिपबोर्ड में कॉपी करें F1 यह सहायता दिखाएं सुविधाएं: • सैन्य-ग्रेड पासवर्ड जनरेशन • रीयल-टाइम शक्ति विश्लेषण • उल्लंघन डेटाबेस जांच (Have I Been Pwned) • पैटर्न डिटेक्शन और सुझाव • सुरक्षित क्लिपबोर्ड ऑटो-क्लियर के साथ • सत्र-केवल पासवर्ड इतिहास

source: PassPilot Supreme v2.0 The Ultimate Password Security Toolkit Features: ✓ Cryptographically secure password generation ✓ Advanced entropy calculation ✓ Real-time strength analysis ✓ Pattern detection ✓ Breach database integration ✓ Smart suggestions ✓ Secure clipboard management ✓ Beautiful modern interface Built with Python & Tkinter © 2025 PassPilot Supreme
hi: पासपायलट सुप्रीम v2.0 अंतिम पासवर्ड सुरक्षा टूलकिट सुविधाएं: ✓ क्रिप्टोग्राफ़िक रूप से सुरक्षित पासवर्ड जनरेशन ✓ उन्नत एन्ट्रॉपी गणना ✓ रीयल-टाइम शक्ति विश्लेषण ✓ पैटर्न डिटेक्शन ✓ उल्लंघन डेटाबेस एकीकरण ✓ स्मार्ट सुझाव ✓ सुरक्षित क्लिपबोर्ड प्रबंधन ✓ सुंदर आधुनिक इंटरफ़ेस Python & Tkinter के साथ निर्मित © 2025 पासपायलट सुप्रीम

source: ⚠️ EXPOSED! Found {0} times in breaches
hi: ⚠️ उजागर! उल्लंघनों में {0} बार पाया गया

source: ✅ Safe! Not found in known breaches
hi: ✅ सुरक्षित! ज्ञात उल्लंघनों में नहीं मिला

source: Password is empty.
hi: पासवर्ड खाली है।

source: API error: {0}
hi: API त्रुटि: {0}

source: Error: {0}
hi: त्रुटि: {0}

source: seconds
hi: सेकंड

source: minutes
hi: मिनट

source: hours
hi: घंटे

source: days
hi: दिन

source: years
hi: साल

source: thousand years
hi: हजार साल

source: millions of years+
hi: लाखों साल+
